# encoding: utf-8
# grep6
# 要注意漢字のgrep

Encoding.default_external = 'UTF-8'

require 'open3'
require 'inifile'
require 'win32ole'
require 'clipboard'
#require 'win32/clipboard'


ini=IniFile.load(__dir__+"/config.ini")
hide=ini["path"]["hide"]
soro=ini["grep"]["soroe"]

$stderr=open("tmp_err.txt","w")
$stdout=open("tmp99.txt","w")
puts Dir.pwd.encode(Encoding::UTF_8)
p soro
print "ARGV=";p ARGV

cbd=ClipBoard.new(__ENCODING__)

#def bsize(txt)
#  txt.to_s.tr("—","-").split("").map{|e| e.bytesize==1 ? 1 : 2}.sum
#  #"—"は３バイト,"-"は１バイトという罠回避
#end
class String
  def bsize
    self.to_s.tr("—","-").split("").map{|e| e.bytesize==1 ? 1 : 2}.sum
    #"—"が実は３バイトという罠回避 "-"は１バイト
  end
end




col=%|
#color[ 1]=val("0x#{ini['color']['color_1']}");
#color[ 2]=val("0x#{ini['color']['color_2']}");
#color[ 3]=val("0x#{ini['color']['color_3']}");
#color[ 4]=val("0x#{ini['color']['color_4']}");
#color[ 5]=val("0x#{ini['color']['color_5']}");
#color[ 6]=val("0x#{ini['color']['color_6']}");
#color[ 7]=val("0x#{ini['color']['color_7']}");
#color[ 8]=val("0x#{ini['color']['color_8']}");
#color[ 9]=val("0x#{ini['color']['color_9']}");
#color[10]=val("0x#{ini['color']['color_10']}");
#color[11]=val("0x#{ini['color']['color_11']}");
#color[12]=val("0x#{ini['color']['color_12']}");
#color[13]=val("0x#{ini['color']['color_13']}");
#color[14]=val("0x#{ini['color']['color_14']}");
#color[15]=val("0x#{ini['color']['color_15']}");
#color[16]=val("0x#{ini['color']['color_16']}");
|


#g6t=open(__dir__+"/grep6.txt").read.chomp
#chk=/[#{g6t}]/

g6t =%Q|
丂丄丅丆丌丏丒专业丛东丝丟丠丢丣两严丧丨丩丫丬丮丯丰丳临丵丷
为丽举乀乁乄乆乇么义乊乌乐乑乒乓乔乚乛乜习乡乣乤乥书乧乨乩乪
乫乬乭乮乯买乲乴乵乶乷乸乹乺乻乼乽乿亁亃亄亇亍亏亐亓亖亗亚亝
亣产亩亪亯亱亲亴亵亷亸亹亻亼亽亾亿仃仅仈仉仌仐仑仒仓仚仛仜仝
仠仡仢仦仧仨仩仪仫们仯仱仳仴仵仸仹仺仼份仾仿伀伂伃伄伅伆伇伈
伋伌伒伓伔伕伖众优伙伛伞伟传伡伢伣伤伥伦伧伨伩伪伫伬伭伮伱伲
伳伵伷伹伻伾伿佀佁佂佄佅佈佉佊佋佌佒佔佖佘佟你佡佢佣佤佥佦佧
佨佪佫佬佭佮佱佲佴佷佸佹佺佽佾侀侁侂侄侅侇侉侊侌侎侐侒侓侔侕
侗侙侚侜侞侟侢侣侤侥侦侧侨侩侪侬侰侱侲侳侴侷侸侹侺侻侼侽侾俀
俁俅俆俇俈俉俋俌俍俏俒俓俕俖俙俜俞俠俢俦俧俨俩俪俫俬俭俰俱俲
俴俷俹俻俼俽俿倀倁倂倃倄倇倈倊倌倎倐倓倕倗倘倛倜倝倞倠倢倧倮
倯倰倱倲倳倴倵倷倸债倻值倽倾倿偀偁偂偄偅偆偊偋偌偍偎偑偒偓偔
偗偘偙偛偝偞偟偠偡偢偣偤偦偧偨偩偪偫偭偮偯偰偱偳偷偹偺偻偼偾
偿傁傂傃傄傆傇傈傉傊傋傌傎傏傐傒傓傔傕傖傗傛傜傝傞傟傠傡傢傣
傤傥傦傧储傩傪傫傮傯傰傱傶傸傹傺傻傼傽傿僀僁僃僄僆僇僈僋僌僎
僐僒僓僔僗僘僙僛僜僝僟僠僡僢僤僦僨僩僪僫僬僯僰僱僲僳僴僶僷僸
僺僼僽僾僿儃儅儆儇儈儊儋儌儍儎儏儐儑儓儗儙儛儜儝儞儠儢儣儤儥
儦儧儨儩儫儬儭儮儯儰儱儳儴儵儶儸儹儽儾兂兊兏兑兓兕兖兗兘兙兛
兝兞兟兠兡兣兤兦內兯兰兲关兴兹兺养兽兾兿冁冃冄冇冈冋冎冔冘冚
军农冝冞冟冡冣冧冭冮冯冸冹冺冻冼冾冿净凁凂凃凇凈凊凎减凐凑凒
凓凔凕凗凘凙凚凜凞凟凢凣凤凥凨凫凬凮凯凲凳凴凷击凼凿刁刂刅刉
刌刍刏刐划刓刕刖刘则刚创刜刞刟删刡刢刣刦刨别刬刭刯刱刲刴刵刼
刽刾刿剀剁剂剅剆剈剉剎剐剑剒剓剕剗剘剙剚剜剝剟剠剡剢剦剧剨剫
剬剭剮剶剷剸剹剺剻剼剾劀劁劂劄劅劆劊劋劌劎劏劐劓劕劖劗劘劙劚
劜劝办务劢劤劥劦劧动劮劯劰劲劳劶劷劸劺劻劽势勀勂勄勆勈勊勋勌
勎勏勐勑勓勔勖勚勛勜勡勥勨勩勪勫勬勭勮勯勰勱勴勶勷勻勼勽匀匃
匄匇匉匊匋匌匎匑匒匓匔匘匛匜匞匟匢匤匥匦匧匨匩匫匬匭匮匰匲匴
匵匶匷匼匽匾卂卄卋卌华协卐单卖卙卛卝卟卡卢卣卤卥卧卨卪卫卬卭
卲卶卹卺卼卽卾厀厁厃厅历厇厈厉厊压厌厍厎厏厐厑厒厓厔厕厗厙厛
厜厝厞厡厢厣厤厧厪厫厬厯厱厲厴厵厷厸厹厺厼厽厾县叀叁叄叅叆叇
叏叐发叒叓叕变叚叜叝叞叠另叧叴叵叹叻叼叽叾叿吀吂吅吆吇吒吓吔
吕吖吗吘吙吚吜吞吡吢吣吤吥吧吨吪启吰吱吲吳吴吵吷吺吿呁呃呄呅
呇呋呌呍呏呐呒呓呔呕呖呗员呙呚呛呜呝呞呠呡呢呣呤呥呦呧呩呫呬
呭呮呯呲呴呸呹呺呾呿咁咂咃咅咇咈咉咊咍咑咓咔咕咖咗咘咙咚咛咜
咝咞咟咠咡咣咦咧咩咪咭咮咰咱咴咵咶咷咹咺咻咿哃哅哆哊哋哌响哎
哏哐哑哒哓哔哕哖哗哙哚哛哜哝哞哟哠哣哤哧哪哫哬哯哰哱哳哴哵哶
哷哸哹哻哼哾哿唀唁唂唃唅唈唉唊唋唌唍唎唑唒唓唕唗唘唙唚唛唜唝
唞唟唠唡唢唣唤唥唦唧唨唩唪唫唬唭唰唲唴唵唶唷唺唻唼唽唿啁啂啃
啇啈啉啊啋啍啎啐啑啒啔啕啘啙啚啛啞啟啠啡啢啤啥啦啧啨啩啪啫啬
啭啮啯啰啱啲啳啴啵啶啷啸啹啺啽啿喁喂喅喆喈喌喍喎喏喐喑喒喓喔
喕喖喗喛喠喡喢喣喤喥喦喭喯喱喲喳喴喵喷喸喹喺喻喼喽喾喿嗀嗁嗂
嗃嗆嗈嗉嗊嗋嗌嗍嗎嗏嗐嗑嗒嗓嗕嗖嗗嗘嗙嗛嗝嗞嗠嗡嗢嗥嗦嗧嗨嗩
嗪嗫嗬嗭嗮嗯嗰嗱嗲嗳嗴嗵嗶嗸嗺嗻嗼嗿嘀嘁嘂嘃嘄嘅嘇嘈嘊嘋嘌嘍
嘎嘏嘐嘑嘒嘓嘕嘙嘚嘜嘝嘞嘟嘠嘡嘢嘣嘤嘥嘦嘧嘨嘪嘫嘬嘭嘮嘰嘳嘵
嘷嘹嘺嘻嘼嘽嘾嘿噀噁噃噄噅噆噇噈噉噊噋噍噏噑噒噓噔噕噖噗噘噙
噚噜噝噞噟噠噡噢噣噥噦噧噩噭噮噯噰噱噲噳噵噶噷噹噻噼噽噾噿嚁
嚂嚃嚄嚅嚈嚉嚋嚌嚍嚎嚐嚑嚒嚓嚕嚖嚗嚘嚙嚚嚛嚜嚝嚞嚟嚡嚣嚤嚦嚧
嚨嚩嚪嚫嚬嚭嚯嚰嚱嚲嚳嚵嚷嚸嚹嚺嚻嚽嚾嚿囄囅囆囇囉囊囋囌囍囏
囐囒囔囕囖囙囜囝囟囡团囤囥囦囧囨囩囪囫囬园囯囱围囵囶囷囸囻囼
图圁圂圅圆圇圊圌圎圐圑圔圕圗圙圚圛圝圞圠圡圢圣圤圥圩圪圫圬圮
圯圱圲圳圴圵圶圹场圼圽圾圿坁坃坄坅坆坈坉坋坌坍坒坓坔坕坖块坘
坙坚坛坜坝坞坟坠坢坣坥坧坨坫坬坭坮坯坰坱坲坳坴坵坶坷坸坹坺坻
坼坽坾垀垁垃垄垅垆垇垊垌垍垎垏垐垑垒垔垕垖垗垘垙垚垛垜垝垞垟
垡垥垦垧垨垩垫垬垭垮垯垱垲垴垵垶垷垸垹垺垻垼垽垾垿埁埂埄埅埇
埈埉埊埌埍埏埐埑埕埗埘埙埚埛埝埞埡埢埤埥埦埧埨埩埪埫埬埭埮埯
埰埱埲埳埵埶埸埻埽埾埿堁堃堄堇堈堉堌堍堎堏堐堑堒堓堔堖堗堘堚
堛堜堞堟堠堢堣堥堦堧堨堩堫堬堭堮堯堲堳堶堷堸堹堻堼堾堿塂塃塄
塅塆塇塈塉塌塍塎塏塐塓塕塖塛塜塝塟塠塡塣塤塥塦塧塨塪塬塭塮塯
塱塳塴塶塷塸塺塻塼塽塿墀墁墂墄墆墇墈墉墊墋墌墍墎墏墐墑墒墔墕
墖墘墙墚墛墝增墠墡墢墣墤墥墦墧墩墪墬墭墯墰墱墲墴墵墶墷墼墽墿
壀壂壃壄壆壈壉壋壍壎壏壐壒壔壖壚壛壝壠壡壢壣壦壧壨壩壪壭壳壴
壵壶壸壾壿夀夁夃处夅夆备夈夋夌复夎夑夒夓夔夗夝夞够夠夡夣夤夦
夨夯夰夳头夵夶夹夺夻夼夽夿奀奁奂奃奅奆奊奋奌奍奒奓奖奙奛奜奝
奞奟奡奣奤奦奫奭奯奰奱奲奵奶奷她奺奻奼奾奿妀妅妆妇妈妉妋妌妎
妏妐妑妒妔妕妗妘妚妜妞妟妠妡妢妤妦妧妩妪妫妭妮妯妰妱妳妴妵妶
妷妸妺妼妽妿姀姁姂姃姄姅姇姈姊姌姍姎姏姒姕姖姗姘姛姝姞姟姠姡
姢姣姤姧姩姬姭姮姯姰姱姲姳姴姵姷姸姹姺姼姽姾娀娂娄娅娆娇娈娊
娋娌娍娎娏娐娒娓娔娕娖娗娙娛娝娞娡娢娣娤娦娧娨娪娫娬娭娮娰娱
娲娳娴娷娸娹娺娻娽娾娿婂婃婄婅婇婈婊婋婌婍婎婏婐婑婒婓婔婕婖
婗婘婙婛婜婝婞婟婠婡婣婤婥婧婨婩婫婭婮婯婰婱婲婳婴婵婶婷婸婹
婺婻婼婽婾媀媁媂媃媄媅媆媇媈媉媊媋媌媍媎媏媐媑媓媔媕媖媗媘媙
媜媝媞媟媠媡媢媣媤媥媦媧媨媩媪媫媬媭媮媯媰媱媲媳媴媵媶媷媸媹
媺媻媿嫀嫃嫄嫅嫆嫇嫈嫊嫍嫎嫏嫑嫒嫓嫔嫕嫘嫙嫚嫛嫜嫝嫞嫟嫠嫢嫤
嫥嫧嫨嫪嫫嫬嫭嫮嫯嫰嫱嫲嫳嫴嫵嫶嫷嫸嫹嫼嫽嫾嫿嬀嬁嬂嬃嬄嬅嬆
嬇嬈嬊嬍嬎嬏嬐嬑嬒嬓嬔嬕嬗嬘嬙嬚嬛嬜嬝嬞嬟嬠嬡嬣嬤嬥嬦嬧嬨嬩
嬫嬭嬮嬯嬱嬳嬴嬵嬷嬸嬹嬺嬻嬼嬽嬿孁孂孄孆孇孈孉孊孋孌孍孎孏孒
孓孖孙孞孠孡孢孧孨孪孬孭孮孯孲孴孶孷孹孻孼孽孾孿宁宂宄宆宊宎
宐宑宒宓宔宖实宠审宧宨宩宪宫宬宭宯宱宲宷宺宻宼宽宾寀寁寈寊寋
寍寎寏寑寕寖寗寘寙寚寜寠寣寪寬寭寯寱寲寴寷对寻导寽尀尃尌尐尒
尔尕尗尘尙尛尜尝尞尟尡尣尥尦尧尩尪尫尬尮尯尰尲尳尴尵尶尷层屃
屄屇屉屌屒屔屖屗屘屙屚屛屜屝屟屢屣屦屧屨屩屪屫屭屰屲屳屴屵屷
屸屺屻屼屽屾屿岀岁岂岃岄岅岆岇岈岉岊岋岍岎岏岒岓岕岖岗岘岙岚
岛岜岝岞岟岠岢岣岤岥岦岧岪岭岮岯岰岲岴岵岹岺岽岿峀峁峂峃峄峆
峈峉峊峋峌峍峎峏峐峑峒峓峔峕峖峗峘峚峛峜峝峞峟峢峣峤峥峦峧峫
峬峮峱峲峳峴峵峷峸峹峼峾峿崀崁崂崃崄崅崆崈崉崊崌崍崏崐崒崓崜
崝崞崠崡崣崤崥崦崧崨崪崫崬崭崮崯崰崱崲崳崴崵崶崷崸崹崺崻崼崽
崾崿嵀嵁嵂嵃嵄嵅嵆嵇嵈嵉嵊嵍嵏嵑嵓嵔嵕嵖嵗嵘嵙嵚嵛嵝嵞嵟嵠嵡
嵢嵣嵤嵥嵦嵧嵨嵪嵫嵭嵮嵰嵱嵲嵴嵵嵷嵸嵹嵺嵻嵼嵽嵾嵿嶀嶁嶃嶅嶆
嶈嶉嶊嶍嶎嶏嶑嶒嶓嶔嶕嶖嶗嶘嶙嶚嶛嶜嶞嶟嶠嶡嶣嶤嶥嶦嶧嶨嶩嶪
嶫嶭嶯嶰嶱嶲嶳嶴嶵嶶嶸嶹嶻嶾嶿巀巁巂巃巄巅巆巇巈巊巋巎巏巐巑
巔巕巗巘巙巚巜巟巠巢巤巩巪巬巭巯巰巶巸巹巺巼巿帀币帄帅帇师帉
帊帍帎帏帐帒帓帔帕帗帘帜帞帟帠帡帢帣帤带帧帨帩帪帬帮帱帲帴帵
帹帺帻帼帾帿幁幂幆幈幉幊幋幍幏幐幑幒幓幖幘幙幚幛幜幝幞幠幥幦
幧幨幩幪幫幬幭幮幯幰幱幷庀庂庅庆庈庉庋庌庍庎庐庑庒库应庘庙庛
庝庞废庡庢庣庤庥庨庩庪庬庮庯庰庱庲庳庴庹庺庻庼庽庾庿廀廄廅廆
廇廋廌廍廎廑廒廔廕廗廘廙廜廞廤廥廦廧廪廫廭廮廯廲廵廹廽开异弅
弆弇弈弎弒弙弚弜弝弞张弡弢弣弤弨弪弫弬弮弰弲弳弴弶弹强弻弽弿
彀彂彃彄彅彆彇彉彋彍彏彐归彔录彘彚彛彞彟彠彣彤彥彧彨彮彯彲彴
彵彶彸彺彻彽彾徆徉徍徎徏徔徕徖徚徛徜徝徟徢徣徤徥徦徧徫徬徯徰
徱徲徵徶德徸徺徻徾徿忀忁忂忄忆忇忈忉忊忋忎忏忐忑忒忓忔忕忚忛
忞忟忡忢忣忥忦忧忨忩忪忬忭忮忯忲忳忴忶忷忹忺忼忾怀态怂怃怄怅
怆怇怈怉怊怋怌怍怑怓怔怗怘怚怞怟怢怣怤怬怭怮怰怲怳怴怵怶怷怸
怹总怼怽怾怿恀恄恅恇恈恉恌恎恏恑恓恔恖恗恘恛恜恝恞恡恦恧恮恱
恲恳恴恶恸恹恺恻恼恽恾恿悀悂悅悆悇悈悊悎悏悐悑悓悕悘悙悜悝悞
悡悢悤悥您悫悬悭悮悯悰悱悷悹悺悻悾悿惀惁惂惃惄惈惉惊惋惌惍惎
惏惐惒惔惕惖惗惙惛惝惞惢惤惥惦惩惪惫惬惭惮惯惲惵惸惼惽惾惿愂
愄愅愇愊愋愌愐愑愒愓愔愖愗愘愙愜愝愞愠愢愣愤愥愦愩愪愫愭愮愯
愰愱愲愳愵愶愷愸愹愺愻慀慁慃慅慆慉慏慐慑慒慔慖慗慛慜慞慠慡慤
慦慩慪慬慭慲慸慹慺慻慼慽慿憀憁憃憄憅憆憈憉憋憌憍憏憒憓憕憗憘
憛憜憝憞憟憠憡憢憣憥憦憨憪憭憯憰憱憳憴憵憷憸憹憻憼憽憿懀懁懂
懄懅懎懏懑懒懓懔懕懖懗懘懙懚懛懜懝懞懟懠懡懢懤懥懧懨懩懪懫懬
懭懮懯懰懱懳懵懹懻戁戂戃戄戅戆戇戋戏戓戕戗战戙戜戠戢戣戤戥戧
戨戩戫戬戭戱戵戶户戹戺戼戽戾扂扃扄扅扆扊扌扏扐扑扒扔扖扗扙扚
扜扝扟扡扢扤扥扦执扩扪扫扬扭扯扰扲扳扴扵扷扸扺扻扽抁抅抆抇抈
抋抌抍抎抏抐抙抚抝抟抠抡抢抣护报抦抧抨抩抪抭抮抯抰抲抳抴抶抷
抸抺抾抿拀拁拃拄拋拎拕拖拚拞拟拢拣拤拥拦拧拨择拪拫拰拲拴拸拹
拺拻拼拽挀挃挄挅挆挊挋挍挎挏挐挒挓挔挕挖挗挘挚挛挜挝挞挠挡挢
挣挤挥挦挩挪挬挭挮挰挱挲挳挴挵挶挷挸挹挻挼捀捁捂捃捄捅捆捇捈
捊捋捎捑捒捓捔捖捘捙捚捛捝捞损捠捡换捣捤捥捦捪捬捭捯捰捱捳捴
捵捸捹捼捽捾捿掁掂掄掅掆掇掊掋掍掐掑掓掔掕掗掙掚掜掝掞掤掦掭
掮掯掰掱掳掶掷掸掹掺掼掽掿揁揂揅揇揈揊揋揌揍揎揑揓揔揕揗揘揙
揜揝揞揟揠揢揤揥揦揧揨揪揫揬揭揯揰揱揲揳揵揷揸揹揻揼揽揾揿搀
搁搂搃搄搅搇搈搉搊搋搌搎搐搑搒搔搕搘搙搚搛搝搞搟搠搡搢搣搤搥
搧搩搪搫搮搯搰搱搲搳搵搷搸搹搻搼搽搿摀摁摃摄摅摆摇摈摉摊摋摌
摍摏摐摑摒摓摔摕摖摗摙摚摛摜摝摞摟摠摡摢摣摤摥摦摨摪摫摬摭摮
摰摱摲摳摴摵摷摹摻摼摽摾摿撀撁撂撄撅撆撇撉撊撋撌撍撎撏撐撑撔
撖撗撘撙撛撜撝撟撠撡撢撣撦撧撨撪撬撯撱撳撴撵撶撷撸撺撽撾撿擀
擃擄擆擈擉擊擋擌擎擏擐擑擓擕擖擗擙擛擜擝擞擟擤擥擨擩擪擫擭擮
擰擳擵擷擸擹擻擼擿攁攂攃攄攆攇攈攉攊攋攌攍攎攏攐攑攒攓攔攕攖
攗攙攚攛攞攟攠攡攢攥攦攧攨攩攭攮攰攱攲攳攺攼攽敀敁敂敃敄敆敇
敉敊敋敌敎敐敒敓敔敚敛敜敟敠敡敤敥敧敨敩敪敫敭敮敯敱敳敶敹敺
敻敼敽敾敿斀斁斄斅斆斊斋斍斏斒斓斔斕斖斘斚斝斞斠斢斣斦斨斩斪
斮斱斲斳斴斵斶斸斺斻斾斿旀旂旇旈旉旊旍旎旐旑旓旔旕旖旘旚旜旝
旞旟旣旤旪旫旮旯旰旲旳旴旵时旷旸旹旼旽旾旿昀昁昄昅昈昉昋昍昐
昑昒昕昖昗昘昙昚昛昝昞昡昢昣昤昦昩昪昫昬昮昰昱昲昳昷昸昹昺昻
昽显晀晅晆晇晈晊晌晍晎晐晑晓晔晕晖晗晘晙晚晛晜晠晡晣晥晪晫晬
晭晱晲晳晵晷晸晹晻晼晽晾晿暀暂暅暆暊暋暌暍暏暐暒暓暔暕暙暚暛
暜暞暟暠暡暣暤暥暧暨暩暪暬暭暯暰暱暲暳暵暶暷暺暻暽暿曀曂曃曅
曆曈曊曋曌曍曎曏曐曑曒曓曔曕曗曘曛曞曟曡曢曣曤曥曧曨曪曫曬曭
曮曯曱曶曺曻朁朂朄朅朆朇朊朌朎朐朑朒朓朘朙朚朜朠朡朢朣朤朥朩
术朰朲朳朵朹朻朼朾杀杂权杄杅杇杈杊杋杌杍杒杔杕杗杘杚杛杝杦杧
杨杩杫杬杮杴杶杸杹杺杻杽枀极枂枃构枆枈枊枍枎枏枑枒枓枔枖枘枙
枛枞枟枣枤枥枧枨枪枫枬枭枮枰枱枲枵枺枻枼枽枾枿柀柂柃柅柇柈柉
柋柌柍柒柕柖柗柙柛柜柟柠柡柣查柦柨柪柫柭柰柲柶柷柸柹柺柼柽栀
栁栅栆标栈栉栊栋栌栍栎栏栐树栒栔栕栘栙栚栛栜栝栟栠栣栤栥栦栧
栨栬栭栮栯栰栱栳栵栶样栺栻栾栿桄桅桇桉桊桋桌桏桒桕桖桗桘桚桛
桞桠桡桢桤桥桦桨桩桪桫桬桭桮桯桰桱桲桳桵桸桹桺桻桼桽梀梂梄梆
梇梈梉梊梋梌梎梐梑梒梕梖梘梙梚梜梞梡梣梤梥梩梪梫梬梮梲梴梷梸
梻梽梾梿检棁棂棃棅棇棈棌棎棏棐棑棓棖棙棛棜棝棞棢棤棥棦棨棩棪
棫棬棭棰棱棳棴棵棶棷棸棻棼棽棾棿椂椃椆椇椉椊椐椑椓椔椕椖椗椘
椝椞椟椠椤椧椩椫椬椭椮椯椱椲椳椵椷椸椺椻椼椾楀楁楂楃楄楅楆楇
楈楉楋楌楍楎楏楐楑楒楖楗楘楛楟楣楤楥楦楧楨楩楬楰楱楲楶楺楻楿
榀榃榄榅榆榇榈榉榋榌榍榏榐榒榓榖榗榘榙榚榝榞榟榡榢榣榤榥榦榨
榩榪榫榬榭榯榰榳榵榶榷榸榹榺榼榽槀槂槄槅槆槇槈槉槏槑槒槔槕槖
槗槚槛槜槟槠槡槢槣槤槥槦槩槪槬槮槯槰槱槳槴槵槶槷槸槺槼槾樀樁
樃樄樆樇樈樉樍樎樏樐樑樕樖樘樚樜樝樠樤樥樦樧樨樬樭樯樰樱樲樳
樴樷樻樼樾樿橀橁橂橃橅橆橉橊橌橍橎橏橐橑橒橓橔橕橖橗橚橛橜橝
橞橠橣橤橥橧橨橩橪橫橬橭橮橯橰橱橳橴橵橶橷橹橺橻橼橽橾檁檂檃
檅檆檇檈檉檊檋檌檏檑檒檓檔檕檖檘檙檚檛檝檞檟檡檤檥檦檧檨檩檫
檭檯檰檱檲檴檵檶檷檹檺檼檽檾檿櫀櫄櫅櫆櫇櫈櫉櫊櫋櫌櫍櫎櫏櫐櫒
櫔櫕櫖櫗櫘櫙櫜櫝櫠櫡櫢櫣櫤櫥櫦櫧櫩櫫櫬櫭櫮櫯櫰櫱櫲櫳櫴櫵櫶櫷
櫸櫹櫼櫽櫾櫿欀欁欂欃欆欇欈欉欋欌欍欎欏欐欑欓欔欕欗欘欙欚欛欜
欞欢欤欥欦欨欩欪欫欬欭欮欯欰欱欳欴欵欶欻欼欿歀歁歂歄歅歆歈歊
歋歍歏歑歒歕歖歗歘歚歜歝歞歠步歧歨歫歬歭歮歰歱歲歵歶歷歺歼歽
歾殁殂殅殇殈殌殎殏殐殑殒殓殔殗殙殚殛殜殝殟殠殡殢殣殥殦殧殨殩
殬殭殮殰殶殸殹殽殾毁毂毃毄毇毈毉毊毌每毐毑毕毖毗毙毚毜毝毞毠
毡毢毣毤毥毦毧毨毩毪毭毮毰毱毲毴毵毶毷毸毹毺毻毼毽毾毿氀氁氂
氃氄氅氆氇氉氊氋氌氍氎氐氒氕氖氘氙氚氜氝氞氟氠氡氢氥氦氧氨氩
氪氫氬氭氮氯氰氱氲氳氵氶氹氺氻氼氽氿汃汄汅汆汇汈汉汊汋汌汍汏
汑汒汓汔汖汘汙汛汜污汣汤汥汦汧汩汫汬汭汮汯汱汴汵汶汷汸汹汻汼
汿沀沄沅沆沇沉沊沋沎沏沑沔沕沗沘沜沝沞沟沠沣沤沥沦沧沨沩沪沬
沭沯沰沲沴沵沶沷泀泂泃泆泇泈泋泍泎泏泐泑泒泔泖泘泚泜泞泟泠泤
泦泧泩泫泬泭泮泲泴泵泶泷泸泹泺泻泼泽泾泿洀洁洂洃洄洅洆洇洈洉
洊洍洎洏洐洑洓洔洕洖洘洚洜洝洠洡洢洣洤洦洧洨洬洭洮洯洰洱洴洷
洹洺洼洿浀浂浃浆浇浈浉浊测浌浍济浏浐浑浒浓浔浕浖浗浘浛浝浞浟
浠浡浢浥浧浨浫浭浯浰浱浲浳浵浶浺浻浼浽浾浿涀涁涂涃涄涆涇涉涊
涋涍涏涐涑涒涔涖涗涘涚涝涞涟涠涡涢涣涤涥润涧涨涩涪涫涬涭涮涰
涱涳涴涶涷涹涺涻涽涾涿淁淂淃淄淈淉淊淍淎淏淐淓淔淖淗淚淛淜淝
淟淠淢淣淥淧淩淭淯淰淲淴淶淸淼淽淾淿渀渁渂渃渄渆渌渍渎渏渐渑
渒渔渖渗渘渜渞渢渧渨渪渰渱渲渳渴渵渶渷渹渻渼渽渿湀湁湂湄湅湆
湇湈湉湋湌湏湐湑湒湓湔湕湗湙湚湜湝湞湠湡湢湣湤湥湦湨湩湪湬湭
湰湱湳湴湵湷湸湹湺湻湼湽溁溃溄溅溆溇溈溉溊溋溍溎溑溒溓溔溕溗
溙溚溛溞溠溡溣溤溦溧溨溩溫溬溭溮溰溱溳溴溵溸溹溻溼溾溿滀滁滃
滆滇滈滊滍滎滏滐滒滖滗滘滙滚滛滜滟滠满滢滣滤滥滦滧滨滩滪滫滭
滮滰滱滳滵滶滹滺滻滼滽漀漃漄漅漇漈漊漋漌漍漎漐漒漖漗漘漙漚漛
漜漝漞漟漡漤漥漦漧漨漩漪漭漮漯漰漳漴漵漶漷漹漺漻漼漽潀潂潃潄
潆潇潈潉潊潋潌潍潎潏潐潑潒潓潕潖潗潙潚潝潞潠潡潢潣潥潧潨潩潪
潫潬潱潲潳潵潶潷潹潻潽潾潿澃澅澇澈澉澊澋澌澍澏澐澒澓澔澕澖澘
澙澚澛澜澝澞澟澠澢澥澦澧澨澩澫澬澭澮澯澰澲澴澵澶澷澸澺澻澼澽
澾澿濄濅濇濈濉濊濋濌濍濎濏濐濑濒濓濖濗濙濚濜濝濞濢濣濥濦濧濨
濩濪濭濰濲濴濵濷濸濹濻濼濽濿瀀瀂瀃瀄瀅瀆瀇瀈瀊瀌瀍瀎瀐瀒瀓瀔
瀖瀗瀙瀜瀠瀡瀢瀣瀤瀥瀨瀩瀪瀫瀭瀮瀯瀱瀳瀴瀵瀶瀷瀸瀹瀺瀻瀼瀽瀿
灀灁灂灃灄灅灆灇灈灉灊灋灍灎灏灐灒灓灔灕灖灗灙灚灛灜灝灞灟灠
灡灢灤灥灦灧灨灩灪灬灭灮灱灲灳灴灵灶灷灹灺灻灾灿炀炁炂炃炄炅
炆炇炈炋炌炍炏炐炑炓炔炕炖炗炘炚炛炜炝炞炟炠炡炢炣炤炥炦炧炨
炩炪炫炰炱炲炴炵炶炷炻炼炽炾炿烀烁烂烃烄烅烆烇烉烊烌烍烎烐烑
烒烓烔烕烖烗烘烚烛烜烞烠烡烢烣烤烥烦烧烨烩烪烫烬热烮烯烰烲烳
烴烵烶烷烸烺烻烼烾烿焀焁焂焃焄焅焆焇焈焊焋焌焍焎焏焐焑焒焓焕
焖焗焘焛焝焞焟焠焢焣焤焥焧焨焩焪焫焬焭焮焯焰焱焲焳焴焵焷焸焹
焺焻焽焾焿煀煁煂煃煄煅煆煇煈煊煋煍煏煐煑煒煓煔煗煘煚煛煜煝煞
煟煠煡煣煨煪煫煭煯煰煱煲煳煴煵煶煷煸煹煺煻煼煾煿熀熁熂熃熅熆
熇熉熋熌熍熎熐熑熒熓熖熗熘熙熚熛熜熝熞熠熡熢熣熤熥熦熧熩熪熫
熭熮熯熰熲熳熴熵熶熷熸熺熻熼熽熿燀燁燂燄燅燆燇燊燋燌燍燏燑燓
燖燘燙燚燛燜燝燞燡燢燣燤燨燩燪燫燯燰燱燲燳燴燶燷燸燺燽燾爀爁
爂爃爄爅爇爈爉爊爋爌爎爏爑爒爓爔爕爖爗爘爙爚爜爝爞爟爠爡爢爣
爤爥爦爧爩爫爮爯爱爳爴爷爸爹牁牂牃牄牅牉牊牍牎牏牐牑牓牔牕牖
牗牚牜牞牠牣牤牥牦牨牪牫牬牭牮牯牰牱牳牵牶牷牸牺牻牼牿犃犄犅
犆犈犉犊犋犌犍犎犏犐犑犓犔犕犗犘犙犚犛犜犝犞犟犡犣犤犥犦犨犩
犪犫犭犮犰犱犳犴犵犷犸犺犻犼犽犾犿狀狁狅狇狈狉狊狋狌狍狏狑狓
狔狕狖狘狚狜狝狞狟狣狤狥狦狧狨狪狫狮狯狰狱狲狳狴狵狶狺狻狾狿
猀猁猂猃猄猅猆猇猈猉猋猌猍猎猏猐猑猒猓猔猕猘猙猚猞猠猡猢猣猤
猦猧猨猬猭猰猱猲猳猵猸猹猺猻猼猽獀獁獂獃獆獇獈獉獊獋獌獍獐獑
獒獓獔獕獖獘獙獚獛獜獝獞獟獠獡獢獤獥獦獧獩獫獬獭獮獯獱獳獴獶
獷獹獼獽獾獿玀玁玂玃玅玆玈玊玌玍玎玏玐玑玒玓玔玕玗玘玙玚玛玜
玝玞玟玠玡玢玣玤玥玦玧玨玪玫玬玭玮环现玱玴玵玶玷玸玹玺玼玽玾
玿珁珃珄珅珆珇珉珋珌珏珐珑珒珓珔珕珖珗珘珙珚珛珜珝珟珡珢珣珤
珦珧珨珩珫珬珯珰珲珳珴珵珶珷珹珺珻珼珽珿琀琁琂琄琇琈琊琋琌琍
琎琏琐琑琒琓琔琕琖琗琘琙琚琛琜琝琞琟琠琡琣琤琦琧琨琩琪琫琬琭
琮琯琰琱琷琸琹琻琼琽琾瑀瑂瑃瑄瑅瑆瑇瑈瑉瑊瑋瑌瑍瑎瑏瑐瑑瑒瑓
瑔瑖瑗瑘瑝瑡瑢瑤瑥瑦瑧瑨瑫瑬瑭瑮瑱瑲瑴瑵瑷瑸瑹瑺瑻瑼瑽瑿璀璁
璂璄璅璆璇璈璉璊璌璍璎璏璐璑璒璓璔璕璖璗璘璙璚璛璜璝璟璠璡璣
璤璥璦璨璩璪璫璬璭璮璯璱璲璳璴璵璶璷璸璹璺璻璼璾璿瓀瓁瓂瓃瓄
瓅瓆瓇瓈瓉瓋瓌瓍瓎瓐瓑瓒瓓瓕瓖瓗瓘瓙瓚瓛瓝瓞瓟瓡瓤瓥瓨瓪瓫瓬
瓭瓯瓳瓴瓵瓹瓺瓻瓼瓽瓾瓿甀甁甂甆甇甈甉甊甋甏甐甒甔甖甗甙甛甝
甠甡產甤甧甩甪甭甮甯甴电甶甹甽甾甿畀畁畂畃畅畇畈畎畐畒畓畕畖
畗畘畞畟畡畣畨畬畮畯畱畲畵畹畺畻畼畽畾疀疁疃疄疅疈疌疍疐疒疓
疕疖疗疘疙疛疜疞疟疠疡疢疤疦疧疨疩疪疬疭疮疯疰疴疶疷疺疻疿痀
痁痄痆痈痉痋痌痎痏痐痑痓痖痗痚痜痝痟痠痡痤痥痦痧痨痪痫痬痭痮
痯痱痵痶痷痸痹痻痽瘀瘂瘃瘄瘅瘆瘇瘈瘊瘌瘎瘏瘐瘑瘒瘓瘔瘕瘖瘗瘘
瘙瘚瘛瘜瘝瘞瘣瘥瘦瘨瘩瘪瘫瘬瘭瘮瘯瘱瘲瘳瘵瘶瘷瘸瘹瘺瘼瘽瘾瘿
癀癁癃癄癅癉癊癋癍癎癏癐癑癓癔癕癗癙癚癛癝癞癟癠癣癤癥癦癫癭
癮癯癱癳癴癵癷癹癿皁皂皅皉皊皌皍皏皑皒皔皕皗皘皛皜皝皞皟皠皡
皢皣皤皥皦皧皨皩皪皫皬皭皯皱皲皳皵皶皻皼皽皾盀盁盄盅盇盉盋盌
盎盏盐监盓盔盕盘盙盚盝盠盢盦盨盩盫盬盭盯盰盱盳盵盶盷盹盺盼盽
盿眀眂眃眅眆眊眍眎眏眐眑眒眓眔眕眖眗眘眙眚眜眝眡眢眣眧眨眪眫
眬眭眮眯眰眱眲眳眴眵眶眹眻眽眾眿睁睂睃睄睅睆睈睉睊睋睌睍睎睏
睐睑睒睓睔睕睖睗睘睙睜睝睞睟睠睢睤睧睩睪睬睭睮睯睰睱睲睳睴睵
睶睷睸睺睻睼睽瞀瞁瞂瞃瞄瞅瞆瞇瞈瞉瞊瞌瞍瞏瞐瞒瞓瞔瞕瞖瞗瞘瞙
瞚瞛瞜瞝瞟瞡瞢瞣瞤瞦瞧瞨瞩瞪瞫瞮瞯瞱瞲瞴瞵瞷瞸瞺瞾矀矁矂矃矄
矅矆矈矉矊矋矌矎矏矐矑矒矓矔矕矖矘矙矝矞矟矠矡矤矦矨矪矫矬矰
矱矲矴矵矶矷矸矹矺矻矽矾矿砀码砃砄砅砆砇砈砉砊砋砍砎砏砐砑砓
砖砗砘砙砚砛砜砝砞砟砡砢砣砤砨砩砪砫砬砭砮砯砰砱砳砵砶砷砸砹
砻砼砽砾础硁硂硃硄硆硇硈硉硊硋硌硍硎硏硐硑硒硓硔硕硖硗硘硙硚
硛硜硞硟硠硡硢硣硤硥硦硧硨硩硪硭确硰硱硳硵硶硷硸硹硺硻硽硾硿
碀碂碃碄碅碈碉碊碋碏碐碒碔碖碘碙碛碜碝碞碟碠碡碢碤碥碦碨碫碬
碭碮碰碱碲碳碴碶碷碸碹碻碽碿磀磂磃磄磇磈磉磌磍磎磏磒磓磕磖磗
磘磙磛磜磝磞磟磠磡磢磣磤磥磦磩磪磫磭磮磰磱磲磳磵磶磷磸磹磺磻
磼磾磿礀礂礃礄礅礆礈礉礊礋礌礍礏礐礓礔礕礖礗礘礚礛礜礝礞礟礠
礡礢礣礤礥礧礨礩礭礮礯礰礱礲礳礴礵礶礷礸礹礻礽礿祂祃祄祅祆祊
祋祌祍祎祏祑祒祔祘祙祛祜祡祣祤祦祧祩祪祫祬祮祯祰祱祲祳祴祵祶
祸祹祻祼祽祾禂禃禆禇禈禉禋禌禐禑禒禓禔禕禖禗禘禙禚禛禜禞禟禠
禡禢禣禤禥禨禩禫禬禭禯禱禲禴禵禶禷禸离禼秂秃秄秅秆秇秈秊秌种
秎秏秐秓秔秖秗秙秚秛秜秝秞秠秢秥秨秪秫秭秮积秱秲秳秴秵秶秷秸
秹秺秼秽秾秿稁稂稃稄稅稆稇稉稊稌稏稐稑稒稓稕稖稛稝稞稡稢稣稤
稥稦稧稨稩稪稫稬稭稯稰稳稴稵稶稸稹稺穁穄穅穇穈穊穋穌穑穒穓穔
穕穖穘穙穚穛穜穝穞穟穠穤穥穦穧穨穪穬穭穮穯穱穲穳穵穷穸穻穼穾
窀窂窅窆窇窉窊窋窌窍窎窏窐窑窔窙窚窛窜窝窞窠窡窢窣窤窥窦窧窨
窫窬窭窱窲窳窴窵窷窸窹窻窼窽窾竀竁竂竆竉竌竎竐竑竔竖竗竘竛竞
竤竧竨竩竫竬竮竱竲竳竴竵竷竻竼竽竾笀笁笃笅笇笉笌笍笎笐笒笓笔
笕笖笗笚笜笝笟笡笢笣笤笧笩笪笫笭笮笯笰笱笲笴笷笸笺笻笼笽笾笿
筀筁筂筃筄筇筊筎筓筕筗筘筙筚筛筜筞筟筠筡筢筣筤筦筨筩筪筫筭筯
筲筳筶筷筸筹筻筼筽签筿简箁箂箃箄箅箈箉箊箌箎箐箑箓箖箛箞箠箢
箣箤箥箦箧箨箩箫箬箮箯箰箲箳箵箶箷箹箺箻箼箽箾箿篂篃篅篈篊篍
篎篐篑篒篓篔篕篖篗篘篙篚篛篜篞篟篡篢篣篧篨篪篫篬篮篯篰篱篲篴
篵篸篹篺篻篼篽篾篿簁簂簃簄簅簆簈簉簊簋簌簎簏簐簕簖簘簙簚簛簜
簝簞簠簢簤簥簦簨簩簬簭簮簯簰簱簲簳簴簵簶簹簺簻簼籁籂籄籅籆籇
籈籉籊籋籎籑籒籓籕籗籙籚籛籜籝籞籡籢籣籦籧籨籩籪籫籭籮籯籰籱
籲籴籶籷籸籹籺类籼籽籿粀粄粅粆粇粈粊粌粎粏粑粓粔粖粙粚粜粝粞
粠粣粦粩粪粬粯粰粴粵粶粷粸粺粻粼粿糁糃糄糆糇糈糉糋糌糍糏糐糑
糓糔糕糗糙糚糛糝糡糣糤糥糦糨糩糪糫糬糭糮糰糱糳糵糷糹糼糽糿紁
紃紇紈紉紌紎紏紑紒紓紖紝紞紟紣紤紥紦紧紨紩紪紭紱紴紶紷紸紻紼
紽紾絀絁絇絈絉絊絍絑絒絓絔絕絗絘絙絚絜絝絟絠絤絥絧絩絪絫絬絭
絯絰絴絷絸絺絻絼絾絿綀綁綂綃綄綅綆綇綈綊綋綌綍綎綐綑綒綔綕綖
綗綘綝綞綠綡綤綥綦綧綨綩綪綳綶綷綹綼緀緁緂緃緄緅緆緈緉緌緍緎
緐緓緔緖緗緙緛緟緢緣緥緦緧緪緫緭緮緰緱緳緵緶緷緸緹緺緼緽緾緿
縀縂縃縆縇縈縌縍縎縏縐縑縓縔縕縖縗縘縙縚縜縝縠縤縥縧縨縩縪縬
縭縯縰縳縴縶縸縼縿繀繂繄繅繇繈繉繌繎繏繐繑繒繓繗繘繛繜繟繠繡
繢繣繤繥繨繫繬繮繯繱繲繳繴繵繶繷繸繺繾纀纁纄纅纆纇纊纋纍纑纕
纗纘纙纚纝纞纟纠纡红纣纤纥约级纨纩纪纫纬纭纮纯纰纱纲纳纴纵纶
纷纸纹纺纻纼纽纾线绀绁绂练组绅细织终绉绊绋绌绍绎经绐绑绒结绔
绕绖绗绘给绚绛络绝绞统绠绡绢绣绤绥绦继绨绩绪绫绬续绮绯绰绱绲
绳维绵绶绷绸绹绺绻综绽绾绿缀缁缂缃缄缅缆缇缈缉缊缋缌缍缎缏缐
缑缒缓缔缕编缗缘缙缚缛缜缝缞缟缠缡缢缣缤缥缦缧缨缩缪缫缬缭缮
缯缰缱缲缳缴缵缷缹缻缼缽缾缿罀罁罂罃罄罆罇罈罉罊罋罏罒罓罖罗
罙罚罛罜罝罞罡罢罣罤罥罦罬罭罯罱罳罴罶罺罻罼罽罾罿羀羁羄羉羋
羍羏羐羑羒羓羕羖羗羘羙羛羜羟羠羡羢羥羦羧羪羫羬羭羰羱羳羴羵羷
羺羻羼羾羿翀翂翃翄翇翈翉翋翍翎翏翐翑翓翖翗翘翙翚翛翜翝翞翟翢
翣翤翥翧翨翪翬翭翮翯翱翲翴翵翶翷翸翺翽翾翿耂耇耈耉耊耍耎耏耑
耓耔耖耚耛耝耞耟耠耢耣耤耥耦耧耩耪耫耬耭耮耯耰耱耲耴耵耷耸耹
耺耼耾聀聁聂聃聄聅聇聈聉聋职聍聎聏聐聑聓联聕聗聙聛聜聝聠聣聤
聥聦聧聩聪聫聬聭聮聱聵聸聺聻聼肀肁肂肃肈肊肍肎肏肐肑肒肔肕肗
肙肜肞肟肠肣肤肦肧肨肫肮肰肳肵肶肷肸肹肻肼肽肾肿胀胁胂胅胇胈
胉胊胋胍胏胐胑胒胓胔胕胗胘胜胟胠胢胣胦胧胨胩胪胫胬胭胮胰胲胳
胵胶胷胹胺胻胾胿脀脁脃脄脋脌脍脎脏脐脑脒脓脔脕脖脗脘脙脜脝脞
脟脠脡脢脤脥脦脧脨脪脫脬脭脮脰脲脴脵脶脷脸脺脻脼脽脿腀腁腂腃
腄腅腇腈腉腊腌腍腏腒腖腗腘腙腚腛腜腝腞腠腡腢腣腤腧腨腩腪腬腭
腯腲腳腵腶腷腻腼腽腾膁膄膅膆膇膉膋膌膍膎膐膑膒膔膖膗膘膙膛膞
膟膡膢膥膦膧膪膫膬膭膮膯膱膲膴膶膷膹膻膼臁臃臄臅臇臊臋臌臎臏
臐臒臔臕臖臗臛臜臝臞臡臢臤臦臩臫臬臮臯臰臱臲臵臶臷臸臹臽臿舀
舃舄舆舋舏舑舓舔舕舙舚舝舠舡舢舣舤舥舦舧舨舭舯舰舱舲舴舺舻舼
舽舾舿艁艂艃艄艅艆艈艉艊艋艌艍艎艏艐艑艒艓艔艕艖艗艛艜艞艠艡
艣艥艧艩艬艭艰艳艴艵艹艺艻艼艽艿芀芁节芃芄芅芆芇芈芉芊芌芎芏
芐芑芓芔芕芖芗芘芚芛芜芞芠芡芢芣芤芧芨芩芪芮芰芲芴芵芶芷芺芼
芾芿苀苁苂苃苄苆苇苈苉苊苋苌苍苎苏苐苕苖苘苚苝苠苢苤苨苩苪苬
苭苮苯苰苲苵苶苷苸苼苽苾苿茀茁茇茈茊茋茌茍茏茐茑茒茓茔茕茙茚
茛茝茞茟茠茡茢茤茥茦茧茩茪茬茭茮茰茳茷茺茻茼茽茾茿荁荂荃荄荆
荇荈荋荌荍荎荑荓荔荕荖荗荙荚荛荜荝荞荟荠荡荢荣荤荥荦荧荨荩荪
荫荬荭荮药荰荱荲荴荶荸荹荺荽荾荿莀莁莂莃莄莆莈莋莌莍莏莐莑莒
莔莕莗莘莙莛莜莝莡莣莤莥莦莧莩莬莭莮莯莰莲莳莴莶获莸莹莺莻莼
莾莿菀菂菃菄菆菇菈菉菋菍菏菐菑菒菔菕菗菙菚菛菝菞菡菢菣菤菥菦
菧菨菪菬菭菮菳菵菶菸菹菺菼菾菿萀萁萂萅萆萈萉萊萏萐萑萒萔萕萖
萗萘萙萚萛萜萝萞萟萡萣萤营萦萧萨萫萭萮萯萰萲萳萴萶萷萹萺萻萾
萿葀葁葂葃葄葅葇葈葊葋葌葍葏葐葑葒葓葔葕葖葘葙葚葜葝葞葟葠葤
葥葧葨葪葰葲葳葴葶葸葻葼葽葾葿蒀蒁蒃蒅蒆蒇蒈蒉蒊蒌蒍蒎蒏蒑蒒
蒓蒕蒖蒗蒘蒚蒛蒝蒞蒠蒢蒣蒤蒥蒦蒧蒨蒩蒪蒫蒬蒮蒯蒰蒱蒳蒴蒵蒶蒷
蒺蒽蒾蓀蓂蓃蓅蓇蓈蓌蓎蓏蓒蓓蓔蓕蓗蓘蓛蓜蓝蓞蓟蓠蓡蓢蓣蓤蓥蓦
蓧蓨蓩蓪蓫蓭蓯蓰蓱蓲蓳蓵蓶蓷蓸蓹蓺蓻蓽蓾蔁蔂蔃蔄蔅蔇蔈蔉蔊蔋
蔌蔍蔎蔏蔐蔒蔖蔙蔛蔜蔝蔞蔠蔢蔣蔤蔥蔧蔨蔩蔪蔫蔮蔯蔰蔱蔲蔳蔴蔶
蔷蔸蔹蔺蔻蔼蔾蔿蕂蕄蕅蕆蕇蕌蕍蕏蕐蕑蕒蕓蕔蕖蕙蕛蕜蕝蕞蕟蕠蕡
蕢蕤蕥蕦蕧蕫蕬蕮蕯蕰蕱蕲蕳蕴蕵蕶蕸蕹蕺蕻蕼蕽蕿薁薂薃薅薆薉薋
薌薍薎薏薒薓薕薖薘薚薝薞薟薠薡薢薣薥薧薭薰薱薲薳薴薵薶薷薸薻
薼薽薾薿藀藂藃藄藅藆藇藈藊藋藌藎藑藒藓藔藖藗藘藙藚藛藞藟藠藡
藢藣藦藧藨藫藬藭藮藯藰藱藲藳藴藵藶藸藼藽藿蘀蘁蘃蘄蘅蘈蘉蘌蘍
蘎蘏蘐蘑蘒蘔蘕蘘蘙蘛蘜蘝蘞蘟蘠蘡蘣蘤蘥蘦蘧蘨蘩蘪蘫蘬蘮蘱蘲蘳
蘴蘵蘶蘷蘸蘹蘺蘻蘼蘽蘾虀虁虂虃虄虅虆虇虈虉虊虋虌虏虑虒虓虖虗
虘虙虛虝虠虡虢虣虤虥虦虨虩虪虬虭虮虯虰虲虳虴虵虶虷虸虺虼虽虾
虿蚀蚁蚂蚃蚄蚅蚆蚇蚈蚉蚍蚎蚏蚐蚑蚒蚔蚖蚗蚘蚙蚚蚛蚜蚝蚞蚟蚠蚡
蚢蚥蚦蚧蚨蚬蚭蚮蚱蚲蚳蚴蚵蚷蚸蚹蚺蚻蚼蚽蚾蚿蛀蛁蛂蛃蛅蛈蛊蛌
蛏蛐蛑蛒蛓蛕蛖蛗蛘蛚蛜蛝蛠蛡蛢蛣蛥蛦蛧蛨蛪蛫蛰蛱蛲蛳蛴蛵蛶蛷
蛺蛼蛽蛿蜁蜄蜅蜇蜋蜌蜎蜏蜐蜓蜔蜕蜖蜗蜙蜛蜝蜞蜟蜠蜡蜢蜣蜤蜦蜧
蜨蜪蜫蜬蜭蜮蜯蜰蜱蜲蜳蜵蜶蜸蜹蜺蜼蜽蜾蝀蝁蝂蝃蝄蝅蝆蝇蝈蝊蝍
蝏蝐蝑蝒蝔蝖蝘蝚蝛蝜蝝蝞蝡蝢蝤蝥蝧蝩蝫蝬蝭蝯蝰蝱蝲蝳蝵蝷蝹蝺
蝻蝼蝽蝾螀螁螃螄螅螆螇螈螉螊螋螌螎螏螐螑螒螓螔螕螖螗螘螙螚螛
螜螝螞螠螡螣螤螥螦螧螨螩螪螬螭螮螰螱螲螴螵螶螷螸螹螼螾螿蟁蟂
蟃蟅蟈蟉蟊蟌蟍蟎蟏蟑蟓蟔蟕蟖蟗蟘蟙蟚蟛蟜蟝蟞蟟蟡蟢蟣蟤蟥蟦蟧
蟨蟩蟪蟫蟬蟭蟮蟰蟱蟳蟴蟵蟸蟺蟼蟽蟿蠀蠁蠂蠃蠄蠆蠇蠈蠉蠊蠋蠌蠐
蠒蠓蠔蠗蠘蠙蠚蠛蠜蠝蠞蠟蠠蠤蠥蠦蠨蠩蠪蠫蠬蠭蠮蠯蠰蠲蠳蠴蠵蠷
蠸蠺蠼蠽蠾蠿衁衃衅衇衈衉衊衋衎衏衐衑衔衕衖衘衚衜衟衠衤补衦衧
衩衪衬衭衮衯衱衳衴衶衸衹衺衻衼袀袃袄袅袆袇袉袊袌袎袏袐袑袓袔
袕袘袚袛袜袝袟袠袡袣袥袦袧袨袩袪袬袭袯袲袳袶袸袹袺袻袼袽袾裀
裆裇裈裉裊裋裌裍裎裐裑裒裓裖裗裚裛裞裠裢裣裤裥裦裧裩裪裫裬裭
裮裯裰裱裵裶裷裺裻裿褀褁褃褅褆褈褉褋褍褎褏褑褔褕褖褗褘褙褚褛
褜褟褠褡褢褣褤褦褧褨褩褬褭褮褯褰褱褲褳褴褵褷褹褺褼褽褾褿襀襂
襅襆襇襈襉襊襋襎襏襐襑襒襓襔襕襗襘襙襚襛襜襝襡襢襣襥襧襨襩襫
襬襮襰襱襳襵襶襸襹襺襻襼襽覀覂覄覅覉覌覍覎覐覑覒覔覕覙覛覜覝
覞覟覠覢覣覤覥覨覫覭覮覰覱覴覵覶覷覸覹覻覼覾见观觃规觅视觇览
觉觊觋觌觍觎觏觐觑觓觔觕觖觗觘觙觛觞觟觠觡觢觤觥觨觩觪觫觬觭
觮觯觰觱觲觳觵觶觷觹觺觻觼觽觾觿訁訄訅訆訇訉訋訍訏訑訒訔訕訙
訚訜訞訠訡訢訤訦訧訨訩訫訬訮訯訰訲訵訷訸訹訽訾訿詀詂詃詄詅詇
詉詊詋詌詍詎詏詓詖詗詘詙詚詜詝詟詡詤詥詧詨詪詯詴詵詶詷詸詹詺
詻詽詾詿誀誁誃誆誈誊誋誎誏誐誒誔誖誗誙誛誜誝誟誢誧誩說誫誮誯
誱誳誴誵誶誷誸誺誻誽誾諀諁諃諅諆諈諉諊諎諐諑諓諔諕諗諘諙諝諟
諣諥諨諩諪諬諯諰諲諴諵諶諹諻諼諽諿謃謅謆謈謉謊謋謍謏謑謒謓謕
謘謜謞謟謢謣謤謥謧謩謪謭謮謯謰謱謲謴謵謶謷謸謺謻謼謽謿譀譂譃
譄譅譆譇譈譊譋譍譐譑譒譓譔譕譗譙譝譞譠譡譢譣譤譥譧譨譩譪譭譮
譳譵譶譸譹譺譻譼譾譿讁讂讄讅讆讇讈讉讋讍讏讑讔讕讗讘讛讜讝讞
讟讠计订讣认讥讦讧讨让讪讫讬训议讯记讱讲讳讴讵讶讷许讹论讻讼
讽设访诀证诂诃评诅识诇诈诉诊诋诌词诎诏诐译诒诓诔试诖诗诘诙诚
诛诜话诞诟诠诡询诣诤该详诧诨诩诪诫诬语诮误诰诱诲诳说诵诶请诸
诹诺读诼诽课诿谀谁谂调谄谅谆谇谈谉谊谋谌谍谎谏谐谑谒谓谔谕谖
谗谘谙谚谛谜谝谞谟谠谡谢谣谤谥谦谧谨谩谪谫谬谭谮谯谰谱谲谳谴
谵谶谸谹谻谼谽谾豀豂豃豄豅豇豉豋豍豏豑豒豓豔豖豗豘豙豛豜豝豞
豟豠豣豤豥豦豧豨豩豭豮豯豰豱豲豳豴豵豶豷豻豽豾豿貀貁貃貄貆貇
貈貋貏貐貑貒貓貕貖貗貙貚貛貜貟貣貤貥貦貱貵貹貺貾賅賆賉賋賌賏
賐賒賔賕賖賗賘賙賝賟賡賥賧賨賩賫賬賮賯賰賱賲賳賴賵賶賷賸賹賾
賿贀贁贂贃贆贉贌贎贑贒贕贗贘贙贚贛贜贝贞负贠贡财责贤败账货质
贩贪贫贬购贮贯贰贱贲贳贴贵贶贷贸费贺贻贼贽贾贿赀赁赂赃资赅赆
赇赈赉赊赋赌赍赎赏赐赑赒赓赔赕赖赗赘赙赚赛赜赝赞赟赠赡赢赣赥
赨赩赪赬赮赯赲赵赶赸赹赺赻赼赽赾赿趀趂趃趄趆趇趈趉趋趌趍趎趏
趐趑趒趓趔趕趖趗趘趚趛趜趝趞趟趠趡趢趤趥趦趧趩趪趫趬趭趮趯趰
趱趲趴趵趶趷趸趹趻趼趽趿跀跁跃跄跅跆跇跈跉跊跍跎跐跑跒跓跔跕
跗跘跙跜跞跠跢跤跥跦跧跩跬跭跮跰跱跲跴跶跷跸跹跺跻跽跾踀踁踂
踃踄踅踆踇踋踌踍踎踑踒踓踔踕踖踗踘踙踚踛踜踠踡踢踣踤踥踦踧踨
踩踫踬踭踮踯踱踲踳踶踷踸踹踺踻踼踽踾踿蹀蹁蹃蹅蹆蹋蹍蹎蹏蹑蹒
蹓蹔蹖蹗蹘蹚蹛蹜蹝蹞蹡蹢蹥蹦蹧蹨蹩蹪蹫蹬蹭蹮蹯蹰蹱蹳蹵蹷蹸蹹
蹺蹻蹽蹾蹿躀躂躃躆躈躉躌躎躏躐躒躕躖躗躘躚躛躜躝躞躟躠躢躣躤
躥躦躧躨躩躭躮躲躳躴躵躶躷躸躹躺躻躼躽躿軀軁軂軃軄軇軉軎軏軐
軑軓軔軕軖軗軘軙軚軜軝軞軠軡軤軥軦軧軨軩軪軬軭軮軯軰軱軲軳軴
軵軶軷軹軺軿輀輁輂輄輆輇輈輋輍輎輏輐輑輖輗輘輚輞輠輡輢輣輤輥
輧輨輫輬輭輮輰輱輲輴輵輶輷輺輼輽轀轁轃轇轈轊轋轏轐轑轒轓轔轕
轖轘轙轚轛轝轞轠轥车轧轨轩轪轫转轭轮软轰轱轲轳轴轵轶轷轸轹轺
轻轼载轾轿辀辁辂较辄辅辆辇辈辉辊辋辌辍辎辏辐辑辒输辔辕辖辗辘
辙辚辝辠辡辢辤辥辦辩辪辫辬辳辴辵辶辸边辽达迀迁迃迆过迈迉迊迋
迌迍迏运迒迓迕迖迗还这进远违连迟迠迡迣迤迧迨迬迮迱迲迳迵迶迻
迼迾迿适逄逇逈选逊逌递逘逛逜逤逥逦逨逩逪逫逬逭逯逰逳逴逷逺逻
逽逿遀遃遄遆遈遌遗遙遚遛遝遟遢遤遦遧遪遫遬遰遱遳遴遹遻遾邅邆
邈邋邌邍邎邐邒邓邔邕邖邗邘邙邚邛邜邝邞邟邠邡邢邤邥邧邩邫邬邭
邮邰邲邳邴邶邷邹邺邻邼邽邾邿郀郂郃郄郅郆郇郈郉郋郌郍郏郐郑郒
郓郔郕郖郗郘郙郚郜郝郞郟郠郣郥郦郧郩郪郫郬郮郯郰郱郲郳郴郶郸
郹郺郻郼郾郿鄀鄁鄃鄄鄅鄆鄇鄈鄉鄊鄋鄌鄍鄎鄏鄐鄑鄓鄔鄕鄖鄗鄘鄚
鄛鄜鄝鄞鄟鄠鄡鄢鄣鄤鄥鄦鄧鄨鄩鄪鄫鄬鄮鄯鄱鄳鄴鄵鄶鄷鄸鄹鄺鄻
鄼鄽鄾鄿酀酁酂酃酄酅酆酇酈酏酐酑酓酕酗酙酚酛酜酝酞酟酠酡酤酦
酧酨酫酭酮酯酰酱酴酶酹酺酻酼酽酾酿醀醁醃醄醅醆醈醊醌醎醏醑醓
醔醕醖醘醙醚醛醝醞醟醠醡醣醥醦醧醨醩醬醭醮醰醱醲醳醶醷醹醻醼
醽醾醿釂釃釄釅释釒釓釔釕釗釙釚釞釠釢釤釥釨釩釪釫釬釭釮釯釰釱
釲釳釴釷釸釹釺釻釽釾鈀鈁鈂鈃鈄鈅鈆鈇鈈鈉鈊鈋鈌鈏鈐鈒鈓鈖鈗鈘
鈙鈚鈛鈜鈝鈟鈠鈡鈢鈣鈤鈥鈦鈧鈨鈪鈫鈭鈮鈯鈰鈱鈲鈳鈵鈶鈸鈹鈺鈻
鈼鈽鈾鉀鉁鉂鉃鉆鉇鉊鉌鉍鉎鉏鉑鉒鉓鉔鉕鉖鉘鉙鉜鉝鉟鉠鉡鉣鉥鉧
鉨鉩鉪鉫鉬鉭鉮鉯鉰鉲鉳鉴鉵鉶鉷鉸鉹鉺鉻鉼鉽鉿銁銂銄銆銇銈銉銊
銋銌銍銎銏銐銒銔銗銙銝銞銟銠銡銢銣銤銥銦銧銨銩銪銫銬銮銯銰銱
銲銳銴銵銶銸銺銻銼銽銾銿鋀鋁鋂鋃鋄鋅鋆鋇鋈鋉鋊鋋鋌鋍鋎鋐鋑鋓
鋔鋕鋖鋗鋘鋙鋚鋛鋜鋝鋞鋟鋠鋡鋢鋣鋥鋦鋧鋨鋫鋬鋮鋯鋰鋱鋴鋵鋶鋷
鋹鋻鋽鋾鋿錀錁錂錃錄錅錇錈錉錊錋錌錍錎錑錒錓錔錕錖錗錛錜錝錞
錟錡錤錥錧錩錪錭錰錱錳錴錶錷錸錹錼錽錾錿鍀鍁鍂鍃鍅鍆鍇鍈鍉鍊
鍌鍎鍏鍐鍑鍒鍓鍕鍗鍘鍙鍚鍝鍞鍟鍡鍢鍣鍤鍥鍦鍧鍨鍩鍪鍫鍭鍯鍰鍱
鍲鍳鍴鍶鍷鍸鍹鍺鍻鍽鍿鎀鎁鎂鎃鎄鎅鎆鎇鎈鎉鎊鎋鎍鎎鎏鎐鎑鎒鎓
鎕鎘鎙鎛鎜鎝鎞鎟鎠鎡鎢鎣鎤鎥鎦鎨鎩鎪鎫鎯鎱鎲鎳鎴鎵鎶鎷鎸鎺鎻
鎼鎽鎾鎿鏀鏁鏂鏄鏅鏆鏇鏉鏊鏋鏌鏍鏎鏏鏒鏓鏔鏕鏙鏚鏛鏜鏞鏟鏠鏢
鏣鏦鏧鏩鏪鏫鏬鏭鏮鏯鏰鏱鏲鏳鏴鏵鏶鏷鏸鏹鏺鏻鏼鏽鏾鏿鐀鐁鐂鐄
鐅鐆鐈鐉鐊鐋鐌鐍鐎鐏鐑鐒鐕鐖鐗鐛鐜鐝鐞鐟鐠鐢鐣鐤鐥鐦鐧鐨鐩鐪
鐬鐭鐮鐯鐰鐱鐲鐳鐴鐷鐹鐻鐼鐽鐾鐿鑀鑂鑃鑅鑆鑇鑈鑉鑊鑋鑌鑍鑎鑏
鑐鑔鑕鑖鑗鑘鑙鑜鑝鑟鑡鑣鑤鑥鑦鑧鑨鑩鑫鑬鑭鑮鑯鑱鑲鑳鑴鑶鑸鑹
鑺鑻钀钂钃钄钅钆钇针钉钊钋钌钍钎钏钐钑钒钓钔钕钖钗钘钙钚钛钜
钝钞钟钠钡钢钣钤钥钦钧钨钩钪钫钬钭钮钯钰钱钲钳钴钵钶钷钸钹钺
钻钼钽钾钿铀铁铂铃铄铅铆铇铈铉铊铋铌铍铎铏铐铑铒铓铔铕铖铗铘
铙铚铛铜铝铞铟铠铡铢铣铤铥铦铧铨铩铪铫铬铭铮铯铰铱铲铳铴铵银
铷铸铹铺铻铼铽链铿销锁锂锃锄锅锆锇锈锉锊锋锌锍锎锏锐锑锒锓锔
锕锖锗锘错锚锛锜锝锞锟锠锡锢锣锤锥锦锧锨锩锪锫锬锭键锯锰锱锲
锳锴锵锶锷锸锹锺锻锼锽锾锿镀镁镂镃镄镅镆镇镈镉镊镋镌镍镎镏镐
镑镒镓镔镕镖镗镘镙镚镛镜镝镞镟镠镡镢镣镤镥镦镧镨镩镪镫镬镭镮
镯镰镱镲镳镴镵镶镸镹镺镻镼镽镾长閁閄閅閆閈閌閍閎閐閒閕閗閚閛
閜閝閞閟閡閦閩閪閫閬閮閯閰閱閳閴閵閶閷閸閺閽閿闀闁闂闄闅闆闈
闉闋闎闏闐闑闒闓闗闙闚闛闝闞闟闠闣闤闦闧门闩闪闫闬闭问闯闰闱
闲闳间闵闶闷闸闹闺闻闼闽闾闿阀阁阂阃阄阅阆阇阈阉阊阋阌阍阎阏
阐阑阒阓阔阕阖阗阘阙阚阛阝阞队阠阢阣阤阥阦阧阩阫阬阭阰阱阳阴
阵阶阷阸阹阺阼阽阾陁陃际陆陇陈陉陊陎陑陒陓陔陕陖陗陘陙陚陠陡
陧陨险陫陭陮陯陱陴陹陻陼陾陿隀隁隂隃隄隇隉隌隐隑隒隓隖隚隝隞
隟隡隢隤隥隦隩隫隬隭隮隯隳隵隺隽难隿雂雃雈雊雏雐雒雓雔雗雘雚
雝雞雟雠雡雤雥雦雧雩雬雭雮雯雱雳雴雵雸雺雼雽雾雿霁霂霃霅霉霋
霌霐霒霔霕霗霘霚霛霝霟霠霡霢霣霥霦霨霩霫霬霭霮霯霱霳霴霵霶霷
霺霻霼霿靀靁靃靅靇靊靋靌靍靎靏靐靑靓靔靕靗靘靚靛靝靟靣靥靧靪
靬靮靯靰靲靳靵靶靷靸靻靽靾靿鞀鞂鞃鞇鞈鞉鞊鞌鞎鞑鞒鞓鞔鞕鞖鞗
鞙鞚鞛鞝鞞鞟鞡鞢鞤鞥鞧鞩鞪鞬鞮鞯鞰鞱鞲鞵鞶鞷鞸鞹鞺鞻鞼鞽鞾鞿
韀韁韂韄韅韇韉韊韌韍韎韏韐韑韒韔韕韖韗韘韙韚韛韝韞韟韠韡韢韣
韤韥韦韧韨韩韪韫韬韯韰韱韴韷韸韹韺韼韽韾頀頄頇頉頊頋頍頎頔頕
頖頙頛頜頝頞頟頠頢頣頥頦頧頨頩頪頫頮頯頰頱頲頳頵頶頹頺頾頿顀
顁顂顃顄顅顇顈顉顊顐顑顒顓顖顗顙顚顜顝顟顠顡顢顣顤顥顦顨顩顪
顬顭顮顲页顶顷顸项顺须顼顽顾顿颀颁颂颃预颅领颇颈颉颊颋颌颍颎
颏颐频颒颓颔颕颖颗题颙颚颛颜额颞颟颠颡颢颣颤颥颦颧颩颫颬颭颮
颰颲颳颴颵颷颸颹颺颻颼颽颾颿飀飁飂飅飇飈飉飊飋飌飍风飏飐飑飒
飓飔飕飖飗飘飙飚飝飞飠飡飣飤飥飦飧飨飪飬飰飱飳飵飶飷飸飹飺飻
飿餀餁餂餄餆餇餈餋餍餎餏餑餕餖餗餙餚餛餜餟餢餣餥餦餧餩餪餫餭
餯餰餱餲餳餴餵餶餷餸餹餺餻餼餿饀饁饃饄饆饇饈饊饍饎饏饓饔饖饘
饙饚饛饜饝饞饟饠饡饢饣饤饥饦饧饨饩饪饫饬饭饮饯饰饱饲饳饴饵饶
饷饸饹饺饻饼饽饾饿馀馁馂馃馄馅馆馇馈馉馊馋馌馍馎馏馐馑馒馓馔
馕馚馛馜馝馞馟馠馡馢馣馤馦馧馩馪馫馯馰馱馲馵馶馷馸馹馺馻馽馾
馿駀駂駃駇駉駊駋駌駍駎駏駓駔駖駗駙駚駜駞駠駡駣駤駥駦駧駨駩駪
駫駬駯駰駳駴駵駶駷駹駺駼駽駾騀騂騃騄騆騇騈騉騊騋騌騍騐騑騔騕
騖騗騘騚騛騜騝騞騟騠騡騢騣騤騥騦騧騩騪騬騭騮騯騱騲騳騴騵騶騸
騹騺騻騼騽騿驁驄驆驇驈驉驊驋驌驎驏驐驑驒驓驔驖驘驙驜驝驞驠驡
驣驦驧驨马驭驮驯驰驱驲驳驴驵驶驷驸驹驺驻驼驽驾驿骀骁骂骃骄骅
骆骇骈骉骊骋验骍骎骏骐骑骒骓骔骕骖骗骘骙骚骛骜骝骞骟骠骡骢骣
骤骥骦骧骩骪骫骬骮骯骱骲骳骴骵骶骷骹骺骻骽骾骿髁髂髃髅髆髇髈
髉髊髋髌髍髎髐髒髕髖髗髙髚髛髜髝髠髡髤髥髧髨髩髬髰髲髳髵髶髸
髹髺髼髽髾髿鬀鬁鬂鬃鬄鬅鬇鬈鬉鬊鬋鬌鬍鬎鬏鬐鬑鬒鬓鬔鬕鬖鬗鬙
鬛鬜鬝鬞鬠鬡鬤鬦鬫鬬鬭鬰鬳鬴鬵鬶鬷鬸鬹鬺鬽鬾鬿魀魆魇魈魉魊魋
魌魐魒魓魕魖魗魙魛魜魝魞魟魠魡魢魣魤魥魦魧魨魩魪魫魬魭魮魰魱
魲魳魵魶魷魸魹魺魻魼魽魾魿鮀鮁鮂鮄鮅鮆鮇鮈鮉鮊鮋鮌鮍鮏鮐鮔鮕
鮘鮙鮚鮛鮜鮝鮞鮡鮢鮣鮤鮥鮦鮧鮩鮬鮯鮰鮱鮲鮳鮵鮶鮷鮸鮺鮻鮼鮽鮾
鮿鯁鯂鯃鯄鯅鯇鯈鯋鯌鯍鯎鯐鯓鯕鯗鯘鯙鯚鯜鯝鯞鯟鯠鯥鯦鯧鯩鯪鯫
鯬鯭鯮鯯鯳鯴鯶鯷鯸鯹鯺鯻鯼鯽鯾鯿鰀鰁鰂鰃鰅鰇鰋鰎鰏鰑鰖鰗鰘鰙
鰚鰜鰝鰞鰟鰠鰢鰣鰦鰧鰨鰩鰪鰫鰬鰱鰳鰴鰵鰶鰷鰸鰼鰽鰿鱀鱁鱂鱃鱄
鱅鱉鱊鱋鱌鱍鱎鱏鱐鱑鱓鱔鱕鱖鱘鱙鱛鱜鱝鱞鱟鱡鱢鱣鱤鱥鱦鱨鱩鱪
鱫鱬鱭鱮鱯鱰鱱鱲鱳鱴鱵鱷鱹鱺鱻鱼鱽鱾鱿鲀鲁鲂鲃鲄鲅鲆鲇鲈鲉鲊
鲋鲌鲍鲎鲏鲐鲑鲒鲓鲔鲕鲖鲗鲘鲙鲚鲛鲜鲝鲞鲟鲠鲡鲢鲣鲤鲥鲦鲧鲨
鲩鲪鲫鲬鲭鲮鲯鲰鲱鲲鲳鲴鲵鲶鲷鲸鲹鲺鲻鲼鲽鲾鲿鳀鳁鳂鳃鳄鳅鳆
鳇鳈鳉鳊鳋鳌鳍鳎鳏鳐鳑鳒鳓鳔鳕鳖鳗鳘鳙鳚鳛鳜鳝鳞鳟鳠鳡鳢鳣鳤
鳦鳨鳪鳭鳮鳯鳱鳲鳵鳷鳸鳹鳺鳻鳼鳽鳾鳿鴀鴁鴂鴄鴅鴊鴋鴌鴍鴏鴐鴑
鴓鴔鴖鴗鴘鴙鴚鴜鴝鴞鴠鴡鴢鴤鴥鴧鴩鴭鴮鴯鴰鴱鴲鴳鴴鴵鴶鴷鴸鴹
鴺鴼鴽鵀鵂鵃鵅鵇鵉鵊鵋鵌鵍鵎鵏鵒鵓鵔鵕鵖鵗鵘鵚鵛鵟鵢鵣鵥鵦鵧
鵨鵩鵪鵫鵭鵮鵰鵱鵳鵴鵵鵶鵷鵸鵹鵻鵼鵽鵾鵿鶀鶁鶂鶃鶄鶅鶆鶈鶊鶋
鶌鶍鶎鶐鶑鶒鶓鶔鶕鶖鶗鶘鶙鶛鶜鶝鶞鶟鶠鶡鶢鶣鶥鶦鶧鶨鶪鶬鶭鶮
鶰鶱鶳鶵鶶鶷鶹鶼鶽鶾鶿鷀鷃鷅鷇鷈鷉鷊鷋鷌鷍鷎鷐鷑鷒鷔鷕鷖鷗鷘
鷚鷛鷜鷝鷞鷟鷠鷡鷢鷣鷤鷥鷧鷨鷩鷪鷫鷬鷮鷰鷱鷳鷴鷵鷶鷷鷻鷼鷾鷿
鸀鸁鸂鸃鸄鸅鸆鸇鸈鸉鸊鸋鸌鸍鸎鸏鸐鸑鸒鸓鸔鸕鸖鸗鸘鸙鸜鸝鸟鸠
鸡鸢鸣鸤鸥鸦鸧鸨鸩鸪鸫鸬鸭鸮鸯鸰鸱鸲鸳鸴鸵鸶鸷鸸鸹鸺鸻鸼鸽鸾
鸿鹀鹁鹂鹃鹄鹅鹆鹇鹈鹉鹊鹋鹌鹍鹎鹏鹐鹑鹒鹓鹔鹕鹖鹗鹘鹙鹚鹛鹜
鹝鹞鹟鹠鹡鹢鹣鹤鹥鹦鹧鹨鹩鹪鹫鹬鹭鹮鹯鹰鹱鹲鹳鹴鹶鹷鹺鹻鹼鹾
麀麂麃麄麅麆麇麉麊麍麎麏麐麔麖麘麙麚麛麜麞麠麡麢麣麤麧麨麫麬
麮麯麰麱麲麳麴麵麶麷麽黀黁黂黃黅黆黇黈黉黊黋黑黓黕黖黗黚黟黡
黢黣黤黦黧黩黪黫黬黭黮黰黱黲黳黵黸黺黾黿鼀鼁鼂鼃鼄鼅鼆鼉鼊鼋
鼌鼍鼏鼐鼑鼒鼔鼖鼗鼘鼙鼚鼛鼜鼝鼞鼟鼢鼣鼤鼥鼦鼧鼨鼩鼪鼫鼭鼮鼯
鼰鼱鼲鼳鼴鼵鼶鼷鼸鼹鼺鼼鼽鼿齀齁齂齃齄齅齆齇齈齉齌齍齐齑齓齕
齖齗齘齙齚齛齜齝齞齤齥齨齩齫齭齮齯齰齱齳齴齵齸齹齺齻齼齽齾齿
|

g6t=g6t.gsub(/\R/,"")
chk=/[#{g6t}]/

ls,kk=cbd.getText,[]
kk=ls.scan(chk).uniq
print "kk=";p kk
print "ARGV=";p ARGV

if /m/=~ARGV[0] #要注意の漢字をマーク
  macro=open("tmp.mac","w")
  macro.print("\uFEFF")
  macro.puts col
  i=3
  kk.each{|e|
    macro.puts %|setsearch "#{e}" , 0x4003819;|
    macro.puts %|colormarkerallfound 0x000000, #color[#{i%16+1}], 11, 1;|
    i+=1
  }
  exit
end

i=1
while FileTest.file?(ofile="tmps_"+sprintf("%#02d",i)+".txt")
  i+=1
end

ofile=File.expand_path(ofile)
p ofile
ofl=open(ofile,"w")
#p Dir.pwd
fname=ARGV[1].encode(Encoding::UTF_8)
fname=File.basename(fname)


n=15 #前後の文字数

if kk.size>0
  kk.each{|e| 
    ofl.puts e+",｜"+e+"《》"
    ls.split(%r|\R|).each_with_index{|f,i|
      if /#{e}/=~f
        a,b,c=$`,$&,$'
        an=(a[-n,n]||a)
        m=(an.bsize>30 ? 0 : 30-an.bsize)
        m=m+3-i.to_s.size
        print "m=";p m
        m=0 if m<0
        am=" "*m
        ofl.puts am+fname+%Q|:(#{i+1}):|+an+b+
          (c[0,n]).gsub(/(?<=[、。])(.*)/,"")
      end}}
  ofl.puts "\n"
end

ofl.puts "要注意の漢字はありません\n" if kk==[]
ofl.close

mac=File.expand_path("tmp.mac")
p mac

macro=open(mac,"w")
macro.print("\uFEFF")
macro.puts %|openfile "#{ofile}",utf8;|
macro.puts col

i=3
macro.puts %|

//setsearch "(.*?):(\\\\(.*?\\\\)):(.*)" , 0x4003819;
//colormarkerallfound 0x000000, 0xc2c79e, 11, 1;;
setsearch ".*=>.*" , 0x4003819;
colormarkerallfound 0x000000, 0xc2c79e, 11, 1;;
setsearch "(.*?):(\\\\(.*?\\\\)):" , 0x4003819;
colormarkerallfound 0, 0xB2B2F5, 0, 0;

|

kk.each{|e|
  #macro.puts %|setsearch "[亜-龠々｜]*#{e}[亜-龠々]*《[^》]*》" , 0x4003819;|
  macro.puts %|setsearch "#{e}" , 0x4003819;|
  macro.puts %|colormarkerallfound 0x000000, #color[#{i%16+1}], 11, 1;|
  i+=1
}

macro.puts %|

gofiletop;enabledraw;save;endmacro;
|
macro.close

spawn(%Q|"#{hide}" /x "#{mac}"|)

__END__

マクロメニュー01.mac
要注意漢字のgrep
